// Напишите функцию calculate() в cart-total.js, которая вычисляет и возвращает стоимость корзины товаров после применения всех скидок. В качестве аргументов функция принимает 3 параметра:

// Общая сумма корзины
// Количество товаров в корзине
// Промокод (по умолчанию null)
// Правила и порядок (порядок важен!) начисления скидок:

// Если промокод равен 'ДАРИМ300', то из суммы вычитается 300 рублей. При этом если сумма меньше 300 рублей, то итоговая стоимость будет 0.
// При количестве товаров в корзине ≥10 применяется скидка 5% ко всей сумме
// При сумме, превышающей 50 000, применяется скидка 20% к сумме превышения (то есть к разнице суммы корзины и 50 000)
// Если промокод равен 'СКИДКА15', то ко всей сумме применяется скидка 15%, но только если сумма ≥20 000
// Каждая следующая скидка должна проверяться и применяться к сумме после применения предыдущих скидок.

// В конце файла с кодом домашнего задания напишите конструкцию export default {название функции}, чтобы была возможность автоматической проверки получившейся функции.

function calculate(totalPrice, countOfProduct, promoCode = null) {
  let endPrice = totalPrice;
  if (promoCode === 'ДАРИМ300') {
    endPrice -= 300;
    if (endPrice <= 0) {
      endPrice = 0;
    }
  }
  if (countOfProduct >= 10) {
    endPrice -= endPrice * 0.05;
    if (endPrice <= 0) {
      endPrice = 0;
    }
  }
  if (endPrice > 50000) {
    endPrice -= (endPrice - 50000) * 0.2;
  }
  if (promoCode === 'СКИДКА15' && endPrice >= 20000) {
    endPrice -= endPrice * 0.15;
  }
  return endPrice;
}
